app/views/users/show.html.erb

			<td><%= book.body %></td>
			<td>コメント数 : <%= book.post_comments.count %></td>
---
SELECT COUNT(*) FROM "post_comments" WHERE "post_comments"."book_id" = ?  [["book_id", 8]]