app/views/books/index.html.erb

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 8]]
---
          	                 <i class="glyphicon glyphicon-heart" aria-hidden="true" style="color: black;"></i>
          	                <%= book.favorites.count %>

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 8]]
---
          	                  <i class="glyphicon glyphicon-heart" aria-hidden="true" style="color: gray;"></i>
          	                <%= book.favorites.count %>

SELECT COUNT(*) FROM "post_comments" WHERE "post_comments"."book_id" = ?  [["book_id", 8]]
---
          	            <% end %></td>
					<td>コメント数 : <%= book.post_comments.count %></td>