app/views/books/show.html.erb

                	    <i class="glyphicon glyphicon-heart" aria-hidden="true" style="color: black;"></i>
                	    <%= @books.favorites.count %>
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 10]]

                	    <i class="glyphicon glyphicon-heart" aria-hidden="true" style="color: gray;"></i>
                	    <%= @books.favorites.count %>
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 11]]

                	<% end %></td>
					<td>コメント数 : <%= @books.post_comments.count %></td>
---
SELECT "post_comments".* FROM "post_comments" WHERE "post_comments"."book_id" = ?  [["book_id", 8]]
SELECT COUNT(*) FROM "post_comments" WHERE "post_comments"."book_id" = ?  [["book_id", 11]]

		<h4>コメント</h4>
	 	<% @books.post_comments.each do |post_comment| %>
---
SELECT "post_comments".* FROM "post_comments" WHERE "post_comments"."book_id" = ?  [["book_id", 11]]